[
    {
        "text": "Job hunting in 2025 be like:\n\nApply.\nWait.\nGet ghosted.\nReapply to the same job because they reposted it again.\nStill ghosted.\nAttend 6 rounds of interviews.\nSolve a business case.\nDesign a product roadmap.\nFix the company’s entire strategy.\nOnly to hear:\n“We went ahead with another candidate.”\nAnd my personal favorite:\n“We’ll get back to you soon.”\n(They never do.)\n\nDear companies,\nWe don’t want coffee at your fancy office.\nWe just want clarity.\nA yes or a no.\n\nNot an existential crisis.\n\nTo all job seekers reading this -\nYou’re not lazy.\nYou’re not unskilled.\nYou’re not the problem.\n\nYou’re just stuck in a broken system where “hiring pipeline” matters more than human dignity.\n\nSo no -\nYou’re not overreacting.\nYou’re just exhausted from proving your worth to people who never intended to hire.\n\nLet’s support each other.",
        "engagement": 342,
        "line_count": 24,
        "language": "English",
        "tags": [
            "Mental Health",
            "Job Search"
        ]
    },
    {
        "text": "Dear recruiters,\n\nIt's already a tough job market.\n\nPlease don’t make it worse by posting ghost jobs.\n\nYou post a job.\nWe apply.\nWe prepare.\nWe wait.\nWe follow up.\n\nBut deep down, we already know...\n\nThat role never existed.\nThat position was never going to be filled.\nIt was just posted for 'pipeline building' or to show 'growth activity.'\n\nAnd yet, we still apply.\n\nBecause we’re hopeful.\nBecause we’re desperate.\nBecause we believe maybe—just maybe—this one will work out.\n\nAfter applying for 100+ jobs and hearing nothing back, we don’t just lose time.\n\nWe lose confidence.\nWe lose self-worth.\nWe start believing we are not enough.\n\nPlease remember:\nFor you, it might just be a 'job listing.'\nBut for us, it’s our future.\n\nBe kind.\nBe honest.\nAnd please… only post if you’re actually hiring.\n\nHere are some numbers -\n\n📌 According to a 2024 Greenhouse survey, over 68% of job seekers believe they’ve applied to roles that were never actually open.\n\n📌 A ResumeBuilder report found that 1 in 5 companies admit to posting jobs they don’t intend to fill — just to look like they’re growing or to gather ‘future candidates.’\n\n📌 Nearly 52% of job seekers say ghost jobs hurt their mental health, and 61% say it led them to take a break from job hunting altogether.\n\nWe’re in the middle of mass layoffs, hiring freezes, and budget cuts.\n\nEvery application we send feels like a shot in the dark.\n\nWe spend hours tailoring our resumes.\nWriting custom cover letters.\nPreparing for interviews that never happen.\n\nAnd even after applying to 100+ roles, the inbox stays silent.\n\nSome do it to look like the company is growing.\nSome do it just to ‘build a pipeline.’\nSome even forget to take the job post down after internal hiring is done.\n\nBut for us — the job seekers — this isn’t a game.\n\nIt's our future.\n\nWe’re not applying just to stay busy.\n\nWe're applying because we’ve rent to pay.\nLoans to repay.\nFamilies to support.\nMental battles to fight — silently.\n\nEvery fake job post wastes our time, energy, and emotional bandwidth.\n\nIt’s exhausting to keep giving your 100% to a system that barely gives 1% back.\nAnd when you do this over and over, day after day…\n\nYou stop feeling human.\nYou start feeling invisible.\n\nSo, please — post jobs only if you genuinely plan to hire.\nDon’t play with our hopes.\nDon’t treat job seekers like data points.\n\nThe market is already brutal.\nDon’t make it worse with empty promises.",
        "engagement": 327,
        "line_count": 54,
        "language": "English",
        "tags": [
            "Job Market",
            "Ghost Jobs"
        ]
    },
    {
        "text": "You won’t believe what happened when I taught a 'chaiwala' SQL.\nI gave him a free YouTube playlist.\nHe finished it in 15 days.\n\nThen built a dashboard for his tea stall.\nNow he tracks peak hours, top-selling items, and even tips.\n\nHe doesn’t have a degree.\nHe has discipline.\n\nDegrees help.\nBut curiosity? It changes lives.\n\nNever underestimate the power of free resources - and the will to learn.\nNever underestimate me, I can write good fictional stories.",
        "engagement": 309,
        "line_count": 11,
        "language": "English",
        "tags": [
            "Learning",
            "SQL"
        ]
    },
    {
        "text": "I shared the heartbreaking news of innocent Hindus being shot in Kashmir.\n\nThey weren’t doing anything wrong.\nThey were just… living.\nWalking. Laughing. Breathing.\nEnjoying a moment in their own country.\n\nAnd now, they’re gone.\n\nAnd when I spoke about it - out of pain, not anger -\n\nThis is what people said -\n'You’re supporting the attackers.'\n'You’re sympathizing with terrorists.'\n'You’re defending them.'\n'I have an agenda.'\n\nNo. I don’t.\nI am against this violence.\nAgainst the hate. Against the bloodshed.\n\nI am angry. And I have every right to be.\nBecause these terrorists, these monsters, they are the true enemy.\n\nNot the innocent civilians. Not the people who want peace.\nBut the cowards who hide behind the guise of religion to murder innocent souls.\n\nThis is about humanity.\nThis is about life.\nThis is about justice.\n\nThose who did this must be held accountable.\nThe punishment should be severe.\nThere’s no room for mercy when innocent lives are taken so ruthlessly.\n\nThose who did this are not humans in my eyes.\nThey are monsters.\nThey ended lives, shattered families, and scarred the soul of this country.\nThere is no defense for what they did.\n\nBut what I did say… is that this is not about religion.\n\nBecause I genuinely believed we all had the right to feel safe in our own land.\n\nTo walk freely. To sit at a tea stall. To smile at strangers.\n\nWithout the fear of being gunned down for simply existing.\n\nBecause I believe with all my heart -\nNo one, no matter their faith -\n - Hindu, Muslim, Christian, Sikh -\n\nNo one, no matter their mother tongue-\n-Kannada, Tamil, Hindi, Punjabi, etc -\n\nNo *Indian citizen* should ever fear being shot while enjoying a vacation in their own country.\n\nNot for the language they speak.\nNot for the name they carry.\nNot for the God they pray to.\n\nIsn’t that the most basic expectation we have from our country?\n\nThat we can walk freely. Smile freely.\nThat we can travel with our families and not wonder if we’ll make it home alive?\n\nThis is about basic humanity.\n\nWhat I am against… is hate.\nWhat I am shattered by… is violence in the name of faith.\n\nPeople using religion to justify murder - that’s the real evil.\n\nThen chanting 'Bismillah' after killing them (It means 'in the name of God')\n\nI didn’t write this post to divide.\n\nPlease don’t use this moment to spread hate.\nPlease don’t comment just to argue or divide.\n\nI wrote it because I’m grieving. Because I’m afraid.\n\nBecause this isn’t you vs me.\nThis should be all of us vs hate. All of us vs violence.\n\nWe deserve to live.\nWe deserve to feel safe.\nWe deserve to be human - without fear.\n\nKashmir is one of the most beautiful place - we call it the 'Heaven' and we all should be able to walk freely there!\n\nI had a conversation with my mother 1 month back to plan a solo trip there and she completely said NO, now I understand her pov.\n\nThis was planned because Kashmir was healing.\nHope was returning.\n\nThat’s all I wanted to say.\nThat’s all my heart could take today.",
        "engagement": 159,
        "line_count": 57,
        "language": "English",
        "tags": [
            "Kashmir",
            "Humanity"
        ]
    },
    {
        "text": "𝗜𝗳 𝘆𝗼𝘂'𝗿𝗲 𝗶𝗻 𝘆𝗼𝘂𝗿 𝟭𝘀𝘁 𝗼𝗿 𝟮𝗻𝗱 𝘆𝗲𝗮𝗿 𝗼𝗳 𝗦𝗼𝗳𝘁𝘄𝗮𝗿𝗲 𝗘𝗻𝗴𝗶𝗻𝗲𝗲𝗿𝗶𝗻𝗴... 𝘀𝘁𝗼𝗽 𝗺𝗮𝗸𝗶𝗻𝗴 𝘁𝗵𝗲𝘀𝗲 𝗺𝗶𝘀𝘁𝗮𝗸𝗲𝘀.\n\nBecause these years? They shape your entire future.\n\n𝗟𝗲𝘁’𝘀 𝗯𝗿𝗲𝗮𝗸 𝗶𝘁 𝗱𝗼𝘄𝗻 👇\n\n\n𝟭. 𝗪𝗲𝗮𝗸 𝗚𝗿𝗶𝗽 𝗼𝗻 𝗙𝘂𝗻𝗱𝗮𝗺𝗲𝗻𝘁𝗮𝗹𝘀\nYou can't code your way through AI prompts forever.\nIf writing a simple algorithm feels impossible without ChatGPT, 𝘁𝗵𝗮𝘁’𝘀 𝗮 𝗿𝗲𝗱 𝗳𝗹𝗮𝗴.\nYou need to master the core:\n-Programming Fundamentals\n-OOP\n-DSA\n-DBMS\n-FIT\nThese are not ‘just courses.’ They’re survival kits for your future.\n\n\n𝟮. 𝗜𝗴𝗻𝗼𝗿𝗶𝗻𝗴 𝗦𝗼𝗳𝘁 𝗦𝗸𝗶𝗹𝗹𝘀\nYou know the code. But can you explain it?\nMost students avoid communication, teamwork, and leadership , thinking it’s secondary.\nIt’s not.\nIf you can’t present your ideas, collaborate in a team, or speak without fear of judgment, your growth is already limited.\n\n\n𝟯. 𝗖𝗵𝗮𝘀𝗶𝗻𝗴 𝗘𝘃𝗲𝗿𝘆 𝗦𝗵𝗶𝗻𝘆 𝗧𝗿𝗲𝗻𝗱\nNew framework? Jump. New library? Jump again.\nThis cycle never ends — and teaches you nothing.\nBefore learning anything new, ask:\nWhy am I learning this?\nIf you can't answer that, you're just collecting unfinished courses.\nPick one. Master it. Build with it.\n\n\n𝟰. 𝗖𝗚𝗣𝗔 𝘃𝘀 𝗦𝗸𝗶𝗹𝗹𝘀 — 𝗡𝗼𝘁 𝗮 𝗕𝗮𝘁𝘁𝗹𝗲\nSome students only chase grades. Others only chase skills.\nYou need both.\nCGPA builds credibility. Skills build opportunity.\nDon’t choose between them.\nLearn how to manage both. Your future self will thank you.\n\n\n𝟱. 𝗡𝗼𝘁 𝗔𝗰𝘁𝗶𝘃𝗲 𝗼𝗻 𝗣𝗿𝗼𝗳𝗲𝘀𝘀𝗶𝗼𝗻𝗮𝗹 𝗣𝗹𝗮𝘁𝗳𝗼𝗿𝗺𝘀\nIf no one knows what you’re building , you’ll be forgotten.\nShow up.\nShare what you’re learning.\nPost your wins.\nAsk questions.\nConnect with mentors.\nYou don’t have to be loud. You just have to be visible.",
        "engagement": 72,
        "line_count": 34,
        "language": "English",
        "tags": [
            "Career Development",
            "Software Engineering"
        ]
    },
    {
        "text": "The only person that you need to impress is the one in the mirror.\n\nThere will always be people who doubt you, criticize you, or try to pull you down.\n\nBut here’s the truth: the loudest voice in your life should be *yours*.\n\nIf you’re right in your eyes, it doesn’t matter what people think of you.\n\nStop waiting for applause. Stop looking for approval. *Work on yourself, every single day.*\n\nEven when you’re tired.\nEven when it feels pointless.\nEven when you feel like the world is ahead of you.\n\nBecause greatness isn’t about being the best—it’s about being better than the person you were yesterday.\n\n*Comparison is the thief of joy.*\n\nYou’re not in a race with anyone. Everyone has their own timeline, their own struggles, and their own triumphs. Focus on showing up for yourself.\n\n💡 *Here’s the secret to growth:*\n\n1️⃣ Take small steps every day. Consistency beats motivation.\n\n2️⃣ Learn something new every day. Knowledge compounds.\n\n3️⃣ Be kind to yourself. You’re a work in progress, and that’s beautiful.\n\nDo not compare your chapter 1 to someone else’s chapter 20.\n\n*Just show up.*\n\nSome days will be tough. Some days you’ll feel like quitting. But remember: each day you invest in yourself is a brick in the foundation of your future.\n\nOne step at a time. One day at a time. *You’ve got this.*",
        "engagement": 85,
        "line_count": 29,
        "language": "English",
        "tags": [
            "Motivation",
            "Self-Improvement"
        ]
    },
    {
        "text": "LinkedIn hides the good jobs behind basic search.\nUse Boolean magic to unlock them. 🧙‍♂️💼\n\nYou’re searching 'Product Manager' on LinkedIn and wondering:\n\n“Why do I keep seeing the same 10 jobs everyone else sees?”\n“Where are the remote roles?”\n“Why do I never get called back?”\n\nBecause you’re using LinkedIn like 90% of people.\n\nBut the top 1%?\nThey use Boolean Search.\n\nWelcome to the Episode 2 of LinkedIn Hacks for getting a job with tricks that actually work :)\n\nAnd here’s the exact formula they use to find hidden jobs 👇\n\n- Try this in your LinkedIn Jobs search bar:\n\n('Product Manager' OR 'Product Owner') AND ('Remote' OR 'WFH') AND ('2025')\n\n🛠️ Then, apply this filter:\n\n➡️ Posted in the past 24 hours\n\n💥 What you get:\n\nFresh jobs \n\nRemote roles across titles\n\nCompanies planning for 2025 hires\n\nHigher chances of getting noticed\n\nMost people search:\n❌ Product Manager\n✅ But Boolean lets you search for Product Manager OR Product Owner\n\n❌ “Remote jobs”\n✅ Boolean lets you find jobs with Remote OR WFH in title or description.\n\nIt’s like switching from candlelight to a telescope.\n\nWant more Boolean strings?\n\nHere’s a bonus for Tech + Remote + Hiring Now:\n('Software Engineer' OR 'Backend Developer') AND ('Remote') AND ('Hiring') AND ('2025')\n\nOr for Design folks:\n('UI Designer' OR 'UX Designer') AND ('Remote') AND ('Immediate joiner')\n\n🧠 Most people don’t get rejected because they’re not qualified.\nThey just don’t know how to search.\n\nIf this blew your mind, comment 🔍 and I’ll share more job hacks that even recruiters don’t talk about.\n\nLet’s get you hired - the smart way.",
        "engagement": 330,
        "line_count": 29,
        "language": "English",
        "tags": [
            "Job Search",
            "LinkedIn Hacks"
        ]
    },
    {
        "text": "I was diagnosed with 'depression' a few months back and I am here to talk about it.\n\nI have been taking prescribed anti-depressants too.\n\nWriting this post is hard? \nYes.\n\nI know that some people aren't supportive and will say that I am doing this for attention - have been there already.\n\nOpenly discussing mental health is crucial because it promotes awareness and normalizes mental health as a part of overall well-being. \n\nWhenever I needed a day off, I used sick leave and I think it’s understandable to use mental health days under sick leave, especially if there’s a concern about societal shyness or stigma. \n\nNo one really talks about it. Right?\n\nHowever, fostering open conversations can gradually shift perceptions and create a more accepting environment.\n\nHere are some reasons why talking about mental health matters:\n\nReduces Stigma: \n\nOpen discussions can help dispel myths and reduce the stigma associated with mental health issues, making it easier for individuals to seek support without fear of judgment.\n\nEncourages Help-Seeking: \n\nWhen mental health is openly talked about, it can encourage others to seek help early, which can lead to better outcomes.\n\nImproves Support in Workplaces:\n\n If employers are aware of the importance of mental health, they may be more likely to implement supportive policies and resources.\n\n\nPromotes Empathy and Understanding: \n\nSharing experiences can foster empathy among peers, leading to stronger, more supportive relationships.\n\nRecognizes Mental Health as a Priority: \n\nMental health is just as important as physical health, and acknowledging this can ensure that individuals prioritize their mental well-being.\n\nTalking about our mental health is really important, just like talking about a cold or a headache. \n\nWhen we're open about needing a break because we're feeling stressed or down, it helps everyone understand that it's okay to have these feelings. \n\nIt's like saying, 'Hey, I'm not feeling great today, and I need some time to feel better.'\n\nWhen we hide our mental health days as just 'sick leave,' we miss the chance to show that our minds need care too. \n\nBut when we're honest about it, we help make it normal to talk about mental health. \n\nThis can make more people feel okay about taking a break when they need it, without feeling shy or worried about what others will think.\n\nSo, even if it feels a bit scary to talk about our mental health, it's a really brave thing to do. It helps us take better care of ourselves and each other. ",
        "engagement": 510,
        "line_count": 34,
        "language": "English",
        "tags": [
            "Mental Health"
        ]
    },
    {
        "text": "Your Ghibli-Style AI Image Just Burned More Energy Than Your Fridge. Still Worth It?\n\nThat cute, dreamy AI-generated image? It looks harmless. But behind the scenes, it’s an energy-hungry beast, devouring electricity and overheating servers across the world.\n\nAnd you’re not alone - millions of people are generating AI art daily, without realizing that this innocent trend is quietly fueling climate change.\n\nThe Harsh Reality of AI Art:\n\n- One high-quality AI image consumes as much energy as charging your phone 50 times.\n\n- A single AI model like Midjourney or Stable Diffusion requires *thousands of GPUs*, each consuming 250-400 watts per hour - that’s like running a fridge non-stop.\n\n- Data centers powering AI art use 200 terawatt-hours per year - more than some small countries!\n\n- These centers require massive cooling systems, wasting *millions of gallons of water* just to keep the machines from melting.\n\nWe’re literally burning the planet for pretty pictures.\n\nThink about it: AI-generated art is fun, but is it worth overheating the Earth for a few likes on Instagram?\n\nWe don’t see the carbon emissions. We don’t see the energy drain. But every time we hit “generate,” we’re pushing the world closer to a climate disaster.\n\nMaybe it’s time we stop using AI just for fun and start thinking about the real cost.",
        "engagement": 412,
        "line_count": 24,
        "language": "English",
        "tags": [
            "Sustainability",
            "AI"
        ]
    },
    {
        "text": "The best advice that I can give you right now is -\n\nDo good, get good.\n\nWhen you have pure intentions and you do good, you'll never lose.\n\nYou'll never lose a person, an opportunity, etc.\n\nIt'll be their loss.\n\nYou'll always win when you move with pure intentions and love.",
        "engagement": 330,
        "line_count": 6,
        "language": "English",
        "tags": [
            "Motivation"
        ]
    },
    {
        "text": "Took a mock interview.\n\nThis man, answered all the questions with GPT.\n\nWhy do people cheat in mock interviews with GPT?\n\nCheating ke liye mock?\n\nGPT toh thik se use krlo.\n\nplease don't copy everything word to word\nHe said - 'Let me know in case you need any other changes in the answer'\n\nchalo yeh tab bhi thik hai.\n\n'I hope this answer satisfies the interviewer, let me know in case you need me to personalize it further'\n\nYaar!!!\n\nNakal ke liye bhi akal chahiye.\n\nIn the end we both were just looking at each other and he laughed.\n\nMain aapko mock interview mein judge nahi karugi.\n\nplease yeh band karo 🙏🏻 \n\nEven if you're cheating always skip the last line of GPT - that's the rule man!!",
        "engagement": 246,
        "line_count": 14,
        "language": "Hinglish",
        "tags": [
            "Scams",
            "Mock Interview"
        ]
    }
]